import React from 'react';
import { Button } from 'antd';

const Home: React.FC = () => {
  return (
    <div className="">
      <p>主题配置测试....</p>
      <Button type="primary" size="large">
        我是Button
      </Button>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
    </div>
  );
};

export default Home;
