import React from 'react';
import { useNavigate } from 'react-router';
import { Button } from 'antd';

type THomeProps = {};

const Home: React.FC<THomeProps> = () => {
  const navigation = useNavigate();

  return (
    <div className="bg-white">
      <p>主题配置测试....</p>
      <Button type="primary" size="large">
        我是Button
      </Button>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>

      <p>
        <Button type="default" onClick={() => navigation('/warehouse')}>
          跳转到warehouse
        </Button>
      </p>

      {/* <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p>
      <p className="mb-10">
        滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....滚动条配置测试....
      </p> */}
    </div>
  );
};

export default Home;
